{
  "backend/main.mo": "Empty Motoko actor serving as a placeholder backend for the ICP canister.",
  "feature_evidence.json": "Feature evidence report documenting implemented features with file mappings, component versions, test IDs, and confidence levels for the astrology landing page.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend components describing their purpose and functionality in the landing page conversion flow.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining light/dark theme variables including gold accents, background, foreground, and component colors.",
  "frontend/index.html": "HTML entry point with viewport meta tag and root div mounting the React application for the astrology remedy guide landing page.",
  "frontend/src/App.tsx": "Main React component orchestrating all landing page sections in conversion-optimized order with CTA click handler for smooth scrolling to price section.",
  "frontend/src/components/BenefitsSection.tsx": "Benefits section displaying four tangible outcomes (financial discipline, emotional calm, clearer decisions, opportunity flow) with icons and descriptions in a responsive grid.",
  "frontend/src/components/FAQSection.tsx": "FAQ accordion component answering three common questions about horoscope requirements, remedy complexity, and expected results timeline.",
  "frontend/src/components/FearBridgeSection.tsx": "Fear/FOMO bridge section explaining how planetary imbalances can block progress despite hard work, introducing the concept of energetic remedies.",
  "frontend/src/components/FinalCTASection.tsx": "Final conversion section with urgency messaging, limited-time offer badge, emotional appeal, and prominent CTA button to drive immediate purchase.",
  "frontend/src/components/Footer.tsx": "Footer component with copyright notice and caffeine.ai attribution link including dynamic UTM tracking parameters based on hostname.",
  "frontend/src/components/HeroSection.tsx": "Hero section with background image overlay, emotional headline about feeling stuck, prominent CTA button, and trust badges to capture attention.",
  "frontend/src/components/PriceSection.tsx": "Displays the pricing section with a discounted offer (₹299 from ₹999), lists included features with checkmarks, and includes a purchase button with trust badges.",
  "frontend/src/components/ProblemSection.tsx": "Presents five common user problems (income instability, health fatigue, mental stress, promotion delays, slow business growth) in a grid layout with icons and descriptions.",
  "frontend/src/components/SolutionSection.tsx": "Shows the product mockup image alongside solution benefits, highlighting practical astrology remedies for money, health, peace, career growth, and business stability.",
  "frontend/src/components/StickyMobileCTA.tsx": "Renders a sticky bottom CTA button on mobile devices that appears after scrolling 300px, prompting users to purchase the guide.",
  "frontend/src/components/TrustBadges.tsx": "Displays three trust badges (instant download, one-time payment, digital access) with icons and descriptions to build credibility.",
  "frontend/src/components/WhatsIncludedSection.tsx": "Lists four main components included in the guide (planet-based remedies, weekly planner, daily checklist, ritual calendar) in a grid layout with icons and descriptions.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages an actor instance based on Internet Identity authentication state, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login/logout functionality, managing auth client creation and identity state with delegation validation.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with custom color variables for light/dark themes, including gold accent colors and typography utilities for the astrology product landing page.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the root App component.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining custom color schemes using OKLCH color space (including primary, secondary, destructive, muted, accent, sidebar, and gold variants), extended theme settings for containers, border radius, shadows, and accordion animations. Includes typography, container queries, and animate plugins.",
  "project_state.json": "Project state document describing a single-page React/TypeScript/Tailwind landing page for a digital astrology remedy guide targeting Indian users aged 22-50, with mobile-first design, gold/white/black color scheme, and conversion-focused structure including hero, problem, solution, benefits, testimonials, FAQ, and CTA sections."
}